# Модуль для экспериментов с моделью AI OpenAI

## Обзор

Модуль предназначен для экспериментов с моделью OpenAI, обрабатывая исходный код или документацию, отправляя их в модель для анализа и получения ответов.
Он использует роль выполнения, установленную в коде, для взаимодействия с моделью. Для роли `doc_writer` используется модель **OpenAI GPT-4** для генерации документации или других текстов. Входные данные для модели включают комментарии и код/документацию, которые передаются в модель для обработки. Ответ модели сохраняется в файл с расширением `.md`.

## Подробнее

Модуль предназначен для автоматической генерации документации на основе кода с использованием модели OpenAI GPT-4. Он выполняет следующие шаги:

1.  **Чтение комментариев и инструкций**: Читает комментарии и инструкции из файлов Markdown, которые используются в качестве подсказок для модели.
2.  **Обработка файлов**: Перебирает файлы в указанной директории, соответствующие заданным шаблонам.
3.  **Взаимодействие с моделью OpenAI**: Отправляет содержимое каждого файла вместе с комментариями и инструкциями в модель OpenAI для генерации документации.
4.  **Сохранение ответов**: Сохраняет сгенерированную документацию в файлы Markdown в соответствующих директориях, определяемых ролью (например, `doc_writer`).
5.  **Исключение файлов и директорий**: Исключает определенные файлы и директории на основе регулярных выражений и списка исключений.

Модуль использует глобальную переменную `role` для определения типа задачи, выполняемой моделью (например, `doc_writer` для генерации документации). В зависимости от роли, модуль выбирает соответствующие файлы комментариев и инструкций, а также директорию для сохранения сгенерированной документации.

## Классы

В данном файле классы отсутствуют

## Функции

### `main`

```python
def main() -> None:
    """ Main function to process files and interact with the model.

    This function reads a comment file, iterates over specified files in the source directory,
    and sends the file content to a model for analysis. It then processes the model\'s response.
    """
```

**Назначение**: Главная функция для обработки файлов и взаимодействия с моделью.

**Как работает функция**:

1.  Определяет роль выполнения (`role`), которая указывает, какую задачу должна выполнить модель (например, `doc_writer` для создания документации).
2.  В зависимости от роли, выбирает файлы комментариев и инструкций для модели.
3.  Читает содержимое этих файлов.
4.  Инициализирует модель OpenAI с использованием прочитанных инструкций.
5.  Перебирает файлы в исходной директории, соответствующие заданным шаблонам (`*.py`, `README.MD`).
6.  Формирует входные данные для модели, объединяя комментарии, расположение файла и содержимое файла.
7.  Отправляет входные данные в модель и получает ответ.
8.  Сохраняет ответ модели в файл Markdown с помощью функции `save_response`.
9.  Обрабатывает возможные исключения, логируя их.
10. Делает паузу перед обработкой следующего файла для предотвращения превышения лимитов API.

**Примеры**:

```python
# Пример вызова функции main
main()
```

### `save_response`

```python
def save_response(file_path: Path, response: str, from_model: str) -> None:
    """ Save the model\'s response to a markdown file with updated path based on role.

    Args:
        file_path (Path): The original file path being processed.
        response (str): The response from the model to be saved.
    """
```

**Назначение**: Сохраняет ответ модели в файл Markdown, обновляя путь файла на основе роли.

**Параметры**:

*   `file_path` (Path): Исходный путь к обрабатываемому файлу.
*   `response` (str): Ответ от модели, который нужно сохранить.
*   `from_model` (str): Название модели, от которой получен ответ.

**Как работает функция**:

1.  Определяет директорию для сохранения файла на основе роли (например, `docs/openai/raw_rst_from_ai` для роли `doc_writer`).
2.  Формирует новый путь к файлу, заменяя часть пути `'src'` на директорию, соответствующую роли.
3.  Изменяет суффикс файла на `.md`.
4.  Создает директорию, если она не существует.
5.  Сохраняет ответ модели в файл с новым путем и кодировкой UTF-8.

**Примеры**:

```python
from pathlib import Path

# Пример вызова функции save_response
file_path = Path("src/module/file.py")
response = "This is the model's response."
save_response(file_path, response, from_model='openai')
```

### `yield_files_content`

```python
def yield_files_content(
    src_path: Path, patterns: list[str]
) -> Iterator[tuple[Path, str]]:
    """ Yield file content based on patterns from the source directory, excluding certain patterns and directories.

    Args:
        src_path (Path): The base directory to search for files.
        patterns (list[str]): List of file patterns to include (e.g., [\'*.py\', \'*.txt\']).

    Yields:
        Iterator[tuple[Path, str]]: A tuple of file path and its content as a string.
    """
```

**Назначение**: Генерирует содержимое файлов на основе шаблонов из исходной директории, исключая определенные шаблоны и директории.

**Параметры**:

*   `src_path` (Path): Базовая директория для поиска файлов.
*   `patterns` (list[str]): Список шаблонов файлов для включения (например, `['*.py', '*.txt']`).

**Возвращает**:

*   `Iterator[tuple[Path, str]]`: Итератор, возвращающий кортеж из пути к файлу и его содержимого в виде строки.

**Как работает функция**:

1.  Определяет регулярные выражения для исключаемых файлов и директорий (например, файлы, содержащие круглые скобки, или директории, начинающиеся с трех и более подчеркиваний).
2.  Определяет список служебных директорий, которые необходимо исключить (`.ipynb_checkpoints`, `_experiments`, `__pycache__`, `.git`, `.venv`).
3.  Перебирает шаблоны файлов и использует `rglob` для поиска файлов, соответствующих шаблону, в исходной директории и ее поддиректориях.
4.  Проверяет, находится ли файл в исключаемой директории. Если да, пропускает его.
5.  Проверяет, соответствует ли файл исключаемому шаблону. Если да, пропускает его.
6.  Читает содержимое файла и возвращает путь к файлу и его содержимое в виде кортежа.

**Примеры**:

```python
from pathlib import Path

# Пример вызова функции yield_files_content
src_path = Path("src")
patterns = ["*.py", "README.MD"]
for file_path, content in yield_files_content(src_path, patterns):
    print(f"File: {file_path}")
    print(f"Content: {content[:100]}...")  # Вывод первых 100 символов содержимого
```

## Переменные

*   `role` (str): Глобальная переменная для роли, определяющая задачу для модели (`doc_writer`).
*   `openai_model_name` (str): Имя используемой модели OpenAI (`gpt-4o-mini`).
*   `openai_assistant_id` (str): Идентификатор ассистента OpenAI.
*   `openai_model` (OpenAIModel): Инстанс класса `OpenAIModel` для взаимодействия с моделью OpenAI.