# Модуль `ai_string_utils.py`

## Обзор

Модуль `ai_string_utils.py` предоставляет утилиты для обработки и нормализации текстовых данных, используемых в задачах обучения моделей ИИ и обработки ответов от этих моделей. Он включает в себя функции для очистки строк для обучения и для удаления обрамляющих блоков кода из ответов ИИ.

## Подробней

Этот модуль содержит функции для подготовки текстовых данных для обучающих наборов (экранирование кавычек, удаление лишних пробелов) и нормализации ответов от языковых моделей (удаление обрамляющих блоков кода). Эти функции помогают обеспечить консистентность и чистоту данных, что важно для эффективной работы моделей машинного обучения.

## Функции

### `string_for_train`

```python
def string_for_train(data: Union[str, List[str]]) -> str:
    """
    Очищает и форматирует данные для обучения.

    Удаляет повторяющиеся пробелы. Экранирует двойные кавычки (`"`) символом обратной косой черты (`\\\\`)
    и заменяет множественные пробельные символы одним пробелом. Удаляет начальные и конечные пробелы.

    Args:
        data (Union[str, List[str]]): Входные данные. Могут быть строкой или списком строк.

    Returns:
        str: Очищенная и объединенная строка (если на входе был список),
             готовая для использования в обучении. Возвращает пустую строку,
             если тип входных данных не строка и не список строк.

    Examples:
        >>> string_for_train('   Это  строка   с "кавычками"   и    пробелами. ')
        'Это строка с \\\\"кавычками\\\\" и пробелами.'
        >>> string_for_train(['Первая строка.', '   Вторая "строка"   с пробелами.'])
        'Первая строка. Вторая \\\\"строка\\\\" с пробелами.'
        >>> string_for_train(None)
        ''
        >>> string_for_train(123)
        ''
    """
    ...
```

**Назначение**: Функция `string_for_train` используется для подготовки текстовых данных к обучению моделей машинного обучения. Она очищает и форматирует входные данные, чтобы обеспечить их консистентность и пригодность для использования в обучающих наборах.

**Параметры**:
- `data` (Union[str, List[str]]): Входные данные, которые могут быть строкой или списком строк.

**Возвращает**:
- `str`: Очищенная и отформатированная строка, готовая для использования в обучении. Если входные данные имеют неверный тип (не строка и не список строк), функция возвращает пустую строку.

**Как работает функция**:
1.  Функция проверяет тип входных данных.
2.  Если входные данные - строка, функция экранирует двойные кавычки, заменяет множественные пробелы одним пробелом и удаляет начальные и конечные пробелы.
3.  Если входные данные - список строк, функция обрабатывает каждый элемент списка, экранируя кавычки, а затем объединяет элементы списка в одну строку с пробелами между ними. После этого удаляются множественные пробелы и обрезаются начальные и конечные пробелы.
4.  Если входные данные имеют неверный тип, функция возвращает пустую строку.

**Примеры**:

```python
test_str = '   Это  строка   с "кавычками"   и    пробелами. '
print(f"Original: '{test_str}'")
print(f"Cleaned:  '{string_for_train(test_str)}'")

test_list = ['Первая строка.', '   Вторая "строка"   с пробелами.', ' Третья    ', '   ']
print(f"Original list: {test_list}")
print(f"Cleaned list: '{string_for_train(test_list)}'")

print(f"Invalid input (int): '{string_for_train(123)}'")
print(f"Invalid input (None): '{string_for_train(None)}'")
```

### `normalize_answer`

```python
def normalize_answer(text: str) -> str:
    """
    Нормализует текстовый ответ, удаляя обрамляющие блоки кода markdown.

    Проверяет, начинается ли строка `text` одним из префиксов из списка
    `_NORMALIZER_PREFIXES` (например, '```html\\n', '```markdown', '```')
    и заканчивается ли она суффиксом `_NORMALIZER_SUFFIX` ('```').
    Если оба условия выполняются, удаляет соответствующий префикс и суффикс.
    В противном случае возвращает исходную строку без изменений.

    Args:
        text (str): Исходная строка текста, потенциально содержащая
                    обрамляющие блоки кода.

    Returns:
        str: Нормализованная строка без начального и конечного блоков кода,
             либо исходная строка, если блоки не найдены.

    Examples:
        >>> normalize_answer("```html\\n<p>Пример</p>\\n```")
        '<p>Пример</p>\\n'
        >>> normalize_answer("```markdown\\n# Заголовок\\nТекст.\\n```")
        '# Заголовок\\nТекст.\\n'
        >>> normalize_answer("```\\nПросто текст\\n```")
        'Просто текст\\n'
        >>> normalize_answer("Обычный текст без блоков.")
        'Обычный текст без блоков.'
        >>> normalize_answer("```Неполный блок")
        '```Неполный блок'
        >>> normalize_answer("Блок в конце```")
        'Блок в конце```'
        >>> normalize_answer("```json\\n{\\"key\\": \\"value\\"}\\n```")
        '{\\"key\\": \\"value\\"}\\n'
        >>> normalize_answer("```md Текст```") # Пример с пробелом после md
        'Текст'
    """
    ...
```

**Назначение**: Функция `normalize_answer` используется для нормализации текстовых ответов, полученных от моделей ИИ. Она удаляет обрамляющие блоки кода, такие как ```html, ```markdown и т.д., чтобы получить чистый текст ответа.

**Параметры**:
- `text` (str): Исходная строка текста, которая может содержать обрамляющие блоки кода.

**Возвращает**:
- `str`: Нормализованная строка без начальных и конечных блоков кода, либо исходная строка, если блоки не найдены.

**Как работает функция**:
1.  Функция проверяет, является ли входной текст строкой. Если нет, возвращается пустая строка.
2.  Функция перебирает список префиксов `_NORMALIZER_PREFIXES` (например, "```html\\n", "```markdown\\n", "```\\n").
3.  Для каждого префикса функция проверяет, начинается ли текст с этого префикса и заканчивается ли суффиксом `_NORMALIZER_SUFFIX` ("```").
4.  Если оба условия выполняются, функция удаляет префикс и суффикс из текста.
5.  Функция возвращает нормализованный текст. Если ни один из префиксов не был найден, возвращается исходный текст.

**Примеры**:

```python
tests_norm = [
    "```html\\n<p>Пример</p>\\n```",
    "```markdown\\n# Заголовок\\nТекст.\\n```",
    "```\\nПросто текст\\n```",
    "Обычный текст без блоков.",
    "```Неполный блок",
    "Блок в конце```",
    "```json\\n{\\"key\\": \\"value\\"}\\n```",
    "```md Текст```"
]
for test_case in tests_norm:
    print(f"Original: '{test_case}'")
    print(f"Normalized: '{normalize_answer(test_case)}'")

print(f"Invalid input (int): '{normalize_answer(123)}'") # type: ignore