[
    {
        "text_input": "דילוג לתוכן HB Dead Sea IL משלוח עד הבית חינם בקנייה מעל 249 ₪. משלוח מהיר עד 3 ימי עסקים משלוח עד הבית חינם בקנייה מעל 249 ₪. משלוח מהיר עד 3 ימי עסקים טיפוח הפנים מינרל+ לחויות לפנים מינרלים ותמציות צמחים סרומים לפנים מסכות פנים מוצרי ניקוי פנים אנטי אייג’ינג סדרת מינרל פפטיד אנטי אייג’ינג סדרת מולטי אקטיב חומצה היאלורונית גוף וספא טיפוח כפות ידיים ורגליים קרמים, חמאות וסרומים לגוף מוצרי רחצה דאודורנטים טיפוח השיער מסכות לשיער שמפו ומרכך סדרת קרטין מוצרים לעיצוב השיער מוצרי בוץ ים המלח מוצרי בריאות מינרלים מינרל טריטמנט טיפוח לגבר מארזים ומתנות אזור אישי תפריט אזור אישי לא נמצאו מוצרים בעגלת הקניות. ₪ 0.00 0 עגלת קניות חיפוש חיפוש טיפוח הפנים מינרל+ לחויות לפנים מינרלים ותמציות צמחים סרומים לפנים מסכות פנים מוצרי ניקוי פנים אנטי אייג’ינג סדרת מינרל פפטיד אנטי אייג’ינג סדרת מולטי אקטיב חומצה היאלורונית גוף וספא טיפוח כפות ידיים ורגליים קרמים, חמאות וסרומים לגוף מוצרי רחצה דאודורנטים טיפוח השיער מסכות לשיער שמפו ומרכך סדרת קרטין מוצרים לעיצוב השיער מוצרי בוץ ים המלח מוצרי בריאות מינרלים מינרל טריטמנט טיפוח לגבר מארזים ומתנות אזור אישי תפריט אזור אישי לא נמצאו מוצרים בעגלת הקניות. ₪ 0.00 0 עגלת קניות חיפוש חיפוש לא נמצאו מוצרים בעגלת הקניות. ₪ 0.00 0 עגלת קניות טיפוח הפנים מינרל+ לחויות לפנים מינרלים ותמציות צמחים סרומים לפנים מסכות פנים מוצרי ניקוי פנים אנטי אייג’ינג סדרת מינרל פפטיד אנטי אייג’ינג סדרת מולטי אקטיב חומצה היאלורונית גוף וספא טיפוח כפות ידיים ורגליים קרמים, חמאות וסרומים לגוף מוצרי רחצה דאודורנטים טיפוח השיער מסכות לשיער שמפו ומרכך סדרת קרטין מוצרים לעיצוב השיער מוצרי בוץ ים המלח מוצרי בריאות מינרלים מינרל טריטמנט טיפוח לגבר מארזים ומתנות חיפוש חיפוש לא נמצאו מוצרים בעגלת הקניות. ₪ 0.00 0 עגלת קניות עמוד הבית / גוף וספא / טיפוח כפות ידיים ורגליים / קרם רגליים אינטנסיבי מועשר בבוץ מים המלח 100ml ↓ 30% 🔍 קרם רגליים אינטנסיבי מועשר בבוץ מים המלח 100ml ₪ 12.00 המחיר המקורי היה: ₪12.00. ₪ 8.40 המחיר הנוכחי הוא: ₪8.40. 100ml/3.4FL.OZ מ\\\"ל מחיר ל100 מ\\\"ל: 12 ₪ כמות של קרם רגליים אינטנסיבי מועשר בבוץ מים המלח 100ml הוספה לסל הוספה למועדפים תיאור מידע נוסף אופן השימוש מרכיבים קרם רגליים רב עוצמה עשיר במיוחד, מועשר בבוץ מים המלח בתוספת מינרלים חיוניים, תמציות צמחים ושמני מרפא כגון: מיץ אלוורה, שמן זית, חמאת שיאה, שמן ארגן, שמן אובליפיחה, שמן עץ התה, שמן לבנדר, תמצית קלנדולה, שמן קוקוס, ופרו-ויטמין B5 + E. הבוץ השחור מועשר במגנזיום, סידן, אשלגן, נתרן וברזל החיוניים לשמירה על עור בריא ומוזן. סגולות הבוץ ידועות כבעלות יכולת להקל על גירויים, יובש, אדמומיות וסדקים בעור. בשימוש קבוע, תוצאות יראו במהרה בעור גמיש, רך וקטיפתי. מוצר חובה בכל בית. 100ml/3.4FL.OZ תכולה 100 מ\\\"ל, 200 מ\\\"ל אופן השימוש אופן השימוש: לפני נעילת נעליים ולפני השינה, לעסות את כף הרגל עד לספיגה. יש להשתמש בתמרוק רק למטרה שלשמה הוא נועד ובהתאם להוראות שימוש, אין לבלוע, יש להימנע ממגע בעיניים, להרחיק מילדים, לשימוש חיצוני בלבד, אין להשתמש במוצר אם ידועה רגישות לאחד המרכיבים, לא לשימוש בתינוקות. אין להשתמש על עור מגורה או פגום .להפסיק את השימוש עם הופעת סימני גירוי. מרכיבים ויטמין E ויטמין B5 חמאת שיאה שמן זית שמן ארגן שמן קלנדולה בוץ ים המלח אובליפיחה אלוורה מקט: 20100 הוספה למועדפים מוצרים נוספים להשלמת הטיפוח מוצרים משודרגים ↓ 30% קרם יום אינטנסיבי בוץ ים המלח מועשר בקולגן ₪ 85.00 המחיר המקורי היה: ₪85.00. ₪ 59.50 המחיר הנוכחי הוא: ₪59.50. הוספה לסל הוספה למועדפים ↓ 30% קרם ידיים אינטנסיבי מועשר בבוץ מים המלח 100ml ₪ 12.00 המחיר המקורי היה: ₪12.00. ₪ 8.40 המחיר הנוכחי הוא: ₪8.40. הוספה לסל הוספה למועדפים הירשמו לרשימת התפוצה שלנו וקבלו עידכונים על כל מה שחדש מאשר/ת קבלת דיוור וחומרים פרסומיים מHBDEADSEA ואת מדיניות הפרטיות Email הרשמה מאשר/ת קבלת דיוור וחומרים פרסומיים מHBDEADSEA ואת מדיניות הפרטיות Email הרשמה Email מאשר/ת קבלת דיוור וחומרים פרסומיים מHBDEADSEA ואת מדיניות הפרטיות הרשמה החנות אודות צור קשר תקנון האתר שאלות נפוצות מדיניות פרטיות מדיניות משלוחים והחזרות מפיצים קטגוריות כל המוצרים טיפוח הפנים גוף וספא טיפוח השיער טיפוח לגבר מוצרי בריאות שירות לקוחות ב-Whatsapp: 050-770-5575 בין השעות 16:00 – 09:00 דוא\\\"ל: info@hbdeadsea.com כתובת למשלוח דואר: ת.ד 4217 – פתח תקווה מוזמנים לבקר אותנו: Facebook Instagram Linkedin Please ensure Javascript is enabled for purposes of website accessibility",
        "output": "{'id_supplier': '11267', 'id_category_default': '', 'id_shop_default': '1', 'id_shop': '1', 'id_tax_rules_group': '13', 'on_sale': '1', 'online_only': '0', 'minimal_quantity': '1', 'price': '150.0', 'active': '1', 'available_for_order': '1', 'show_condition': '1', 'condition': 'new', 'show_price': '1', 'visibility': 'both', 'is_virtual': '0', 'state': '1', 'product_type': 'standard', 'description': {'language': {'attrs': {'id': 1}, 'value': ''}}, 'description_short': {'language': {'attrs': {'id': 1}, 'value': 'קרם רגליים רב עוצמה עשיר במיוחד, מועשר בבוץ מים המלח בתוספת מינרלים חיוניים, תמציות צמחים ושמני מרפא כגון: מיץ אלוורה, שמן זית, חמאת שיאה, שמן ארגן, שמן אובליפיחה, שמן עץ התה, שמן לבנדר, תמצית קלנדולה, שמן קוקוס, ופרו-ויטמין B5 + E. הבוץ השחור מועשר במגנזיום, סידן, אשלגן, נתרן וברזל החיוניים לשמירה על עור בריא ומוזן. סגולות הבוץ ידועות כבעלות יכולת להקל על גירויים, יובש, אדמומיות וסדקים בעור. בשימוש קבוע, תוצאות יראו במהרה בעור גמיש, רך וקטיפתי. מוצר חובה בכל בית.'}}, 'name': {'language': {'attrs': {'id': 1}, 'value': 'קרם רגליים אינטנסיבי מועשר בבוץ מים המלח 100ml'}}, 'specification': {'language': {'attrs': {'id': 1}, 'value': ''}}}"
    }
]