# Модуль `any`

## Обзор

Модуль `any` содержит утилиты для рекурсивного преобразования данных любого типа в словарь. Это полезно для сериализации данных в форматы, такие как JSON.

## Подробней

Модуль предоставляет функцию `any2dict`, которая рекурсивно преобразует входные данные в словарь. Он обрабатывает различные типы данных, такие как списки, кортежи, множества, целые числа, числа с плавающей запятой, строки, булевы значения и None. Для объектов, у которых есть атрибут `__dict__`, он преобразует атрибуты объекта в словарь. Если преобразование невозможно, возвращает `False`.

## Функции

### `any2dict`

```python
def any2dict(any_data: Any) -> dict | list | Any | bool:
    """
    Рекурсивно преобразует любой тип данных в словарь.

    Args:
        any_data (Any): Любой тип данных.

    Returns:
        dict | list | Any | bool: Словарь, представляющий входные данные,
        список, базовый тип данных или `False`, если преобразование невозможно.
    """
    ...
```

**Назначение**: Рекурсивно преобразует любой тип данных в словарь.

**Параметры**:
- `any_data` (Any): Входные данные любого типа.

**Возвращает**:
- `dict | list | Any | bool`:  Словарь, представляющий входные данные, список,
   базовый тип данных, или `False`, если преобразование невозможно.

**Как работает функция**:
- Функция `any2dict` принимает данные любого типа и пытается преобразовать их в словарь.
- Если входные данные не являются экземпляром `set`, `list`, `int`, `float`, `str`, `bool` или `None`, функция проверяет, есть ли у входных данных атрибут `__dict__` или являются ли они экземпляром `dict`.
- Если у входных данных есть атрибут `__dict__`, функция итерируется по элементам `__dict__` и рекурсивно вызывает `any2dict` для каждого ключа и значения.
- Если входные данные являются экземпляром `dict`, функция итерируется по элементам словаря и рекурсивно вызывает `any2dict` для каждого ключа и значения.
- Если входные данные являются экземпляром `list` или `tuple`, функция итерируется по элементам списка/кортежа и рекурсивно вызывает `any2dict` для каждого элемента.
- Если входные данные являются экземпляром `set`, функция итерируется по элементам множества и рекурсивно вызывает `any2dict` для каждого элемента.
- Если входные данные являются экземпляром `int`, `float`, `str`, `bool` или `None`, функция возвращает входные данные как есть.
- Если входные данные имеют неподдерживаемый тип данных, функция возвращает `False`.

**Примеры**:

```python
import types
data1 = {
    "name": "John",
    "age": 30,
    "address": {
        "city": "New York",
        "street": "Main St",
        "numbers":[1,2,3]
    },
   "phones": ["123-456-7890", "987-654-3210"],
   "skills": {"python", "java", "c++"}
}

print(any2dict(data1))
# Вывод: {'name': 'John', 'age': 30, 'address': {'city': 'New York', 'street': 'Main St', 'numbers': [1, 2, 3]}, 'phones': ['123-456-7890', '987-654-3210'], 'skills': ['python', 'java', 'c++']}

data2 = [1, 2, "three", {"key": "value"}]
print(any2dict(data2))
# Вывод: [1, 2, 'three', {'key': 'value'}]

data3 = 123
print(any2dict(data3))
# Вывод: 123

data4 = "string"
print(any2dict(data4))
# Вывод: string

data5 = None
print(any2dict(data5))
# Вывод: None

class MyClass:
    def __init__(self, x):
        self.x = x

data6 = MyClass(10)
print(any2dict(data6))
# Вывод: {}

# Тестируем SimpleNamespace
data7 = types.SimpleNamespace(a=1, b='hello', c=[1,2,3])
print(any2dict(data7))
# Вывод: {'a': 1, 'b': 'hello', 'c': [1, 2, 3]}

data8 = {'a':1, 'b': types.SimpleNamespace(x=2, y=3)}
print(any2dict(data8))
# Вывод: {'a': 1, 'b': {'x': 2, 'y': 3}}

data9 = [types.SimpleNamespace(x=2), 3, 'str']
print(any2dict(data9))
# Вывод: [{'x': 2}, 3, 'str']

data10 = types.SimpleNamespace(a=1, b=MyClass(3))
print(any2dict(data10))
# Вывод: {'a': 1, 'b': ''}

data11 = {"a":1, "b": MyClass(10)}
print(any2dict(data11))
# Вывод: {'a': 1, 'b': ''}