# Модуль для декодирования Unicode escape-последовательностей
## \file hypotez/src/utils/convertors/unicode.py

## Обзор

Модуль предоставляет функцию `decode_unicode_escape`, которая декодирует значения в словарях, списках или строках, содержащие Unicode escape-последовательности, в читаемый текст. Это особенно полезно при работе с данными, полученными из источников, где Unicode символы представлены в виде escape-последовательностей (например, `\u05de`).

## Подробнее

Модуль содержит единственную функцию `decode_unicode_escape`, которая рекурсивно обрабатывает входные данные, будь то словарь, список или строка. Для строк выполняется декодирование escape-последовательностей с использованием регулярных выражений и методов кодирования/декодирования.

## Функции

### `decode_unicode_escape`

```python
def decode_unicode_escape(input_data: Dict[str, Any] | list | str) -> Dict[str, Any] | list | str:
    """Функция декодирует значения в словаре, списке или строке, содержащие юникодные escape-последовательности, в читаемый текст.

    Args:
        input_data (dict | list | str): Входные данные - словарь, список или строка, которые могут содержать юникодные escape-последовательности.

    Returns:
        dict | list | str: Преобразованные данные. В случае строки применяется декодирование escape-последовательностей. В случае словаря или списка рекурсивно обрабатываются все значения.
    """
```

**Назначение**: Декодирование Unicode escape-последовательностей во входных данных (словарь, список или строка).

**Параметры**:

- `input_data` (Dict[str, Any] | list | str): Входные данные для декодирования.

**Возвращает**:

- Dict[str, Any] | list | str: Декодированные данные.

**Как работает функция**:

1.  **Проверка типа данных**: Функция определяет тип входных данных (`input_data`).
2.  **Обработка словаря**: Если входные данные - словарь, функция рекурсивно вызывает себя для каждого значения в словаре.
3.  **Обработка списка**: Если входные данные - список, функция рекурсивно вызывает себя для каждого элемента в списке.
4.  **Обработка строки**: Если входные данные - строка, функция пытается декодировать escape-последовательности:
    *   Декодирует строку, используя `encode('utf-8').decode('unicode_escape')`.
    *   Использует регулярное выражение для поиска и декодирования последовательностей вида `\\uXXXX`.
5.  **Обработка других типов данных**: Если входные данные имеют другой тип, они возвращаются без изменений.

**Примеры**:

```python
input_dict = {
    'product_name': r'\u05de\u05e7\"\u05d8 \u05d9\u05e6\u05e8\u05df\nH510M K V2',
    'category': r'\u05e2\u05e8\u05db\u05ea \u05e9\u05d1\u05d1\u05d9\u05dd',
    'price': 123.45
}

input_list = [r'\u05e2\u05e8\u05db\u05ea \u05e9\u05d1\u05d1\u05d9\u05dd', r'H510M K V2']

input_string = r'\u05de\u05e7\"\u05d8 \u05d9\u05e6\u05e8\u05df\nH510M K V2'

# Применяем функцию
decoded_dict = decode_unicode_escape(input_dict)
decoded_list = decode_unicode_escape(input_list)
decoded_string = decode_unicode_escape(input_string)

print(decoded_dict)
print(decoded_list)
print(decoded_string)