# Модуль экспериментов с OpenAI Bot

## Обзор

Модуль предназначен для экспериментов с моделью AI OpenAI. Он обрабатывает исходный код или документацию, отправляет его в модель для анализа и получения ответов.

## Подробнее

Модуль использует роль выполнения, установленную внутри кода, для взаимодействия с моделью. Для роли `doc_writer` используется модель **OpenAI GPT-4** для генерации документации или других текстов. Входные данные для модели включают комментарии и код/документацию, которые передаются в модель для обработки. Ответ модели сохраняется в файл с расширением `.md` в зависимости от роли.

Используемая модель:
- **OpenAI GPT-4**: Используется для создания документации и других текстовых материалов.

Ссылки на документацию модели:
- OpenAI: https://platform.openai.com/docs

## Функции

### `main`

```python
def main() -> None:
    """ Main function to process files and interact with the model.

    This function reads a comment file, iterates over specified files in the source directory,
    and sends the file content to a model for analysis. It then processes the model's response.
    """
```

**Назначение**: Основная функция для обработки файлов и взаимодействия с моделью.

**Как работает функция**:

1.  **Определение роли**: Функция определяет роль выполнения (`role`), которая используется для выбора соответствующих комментариев и инструкций для модели.

2.  **Чтение комментариев и инструкций**: В зависимости от роли (`doc_writer`), функция считывает комментарии и системные инструкции из файлов `.md`.

3.  **Инициализация OpenAIModel**: Создается экземпляр класса `OpenAIModel` с использованием считанных системных инструкций, имени модели и идентификатора ассистента.

4.  **Итерация по файлам**: Функция итерируется по файлам в исходной директории (`gs.path.src`) с использованием `yield_files_content` и обрабатывает содержимое каждого файла.

5.  **Формирование контента для модели**: Для каждого файла формируется входной контент, включающий комментарии, расположение файла и сам код.

6.  **Взаимодействие с моделью**: Отправляет контент в модель OpenAI для получения ответа.

7.  **Сохранение ответа**: Сохраняет ответ модели в файл с расширением `.md` с использованием функции `save_response`.

8.  **Обработка ошибок**: В случае возникновения ошибки при обработке файла, она логируется с использованием `logger.error`.

9.  **Задержка**: Функция делает паузу на 20 секунд, чтобы избежать ограничений API.

**ASCII flowchart**:

```
Начало
  ↓
Определение роли
  ↓
Чтение комментариев и инструкций
  ↓
Инициализация OpenAIModel
  ↓
Итерация по файлам
  ↓
Формирование контента для модели
  ↓
Взаимодействие с моделью
  ↓
Сохранение ответа
  ↓
Обработка ошибок
  ↓
Задержка
  ↓
Конец
```

**Примеры**:

```python
main()
```

### `save_response`

```python
def save_response(file_path: Path, response: str, from_model: str) -> None:
    """ Save the model's response to a markdown file with updated path based on role.

    Args:
        file_path (Path): The original file path being processed.
        response (str): The response from the model to be saved.
    """
```

**Назначение**: Сохраняет ответ модели в файл с расширением `.md` с учетом роли выполнения.

**Параметры**:

*   `file_path` (Path): Исходный путь к файлу, который был обработан.
*   `response` (str): Ответ от модели, который необходимо сохранить.
*   `from_model` (str): Название модели, от которой получен ответ.

**Как работает функция**:

1.  **Определение директории для сохранения**: Функция определяет директорию для сохранения файла на основе роли выполнения (`role`). Используется словарь `role_directories`, который связывает роли с директориями.

2.  **Формирование нового пути к файлу**: На основе исходного пути к файлу и директории для сохранения формируется новый путь к файлу. При этом часть пути, содержащая `"src"`, заменяется на директорию, соответствующую роли.

3.  **Изменение расширения файла**: Расширение файла изменяется на `.md`.

4.  **Создание директории**: Убеждается, что директория для сохранения файла существует, и создает ее при необходимости.

5.  **Сохранение ответа**: Сохраняет ответ модели в новый файл с использованием кодировки UTF-8.

6.  **Вывод сообщения**: Выводит сообщение о том, куда был сохранен файл.

**ASCII flowchart**:

```
Начало
  ↓
Определение директории для сохранения
  ↓
Формирование нового пути к файлу
  ↓
Изменение расширения файла
  ↓
Создание директории
  ↓
Сохранение ответа
  ↓
Вывод сообщения
  ↓
Конец
```

**Примеры**:

```python
from pathlib import Path
file_path = Path('src/some/path/to/file.py')
response = "This is a sample response from the model."
save_response(file_path, response, from_model='openai')
```

### `yield_files_content`

```python
def yield_files_content(
    src_path: Path, patterns: list[str]
) -> Iterator[tuple[Path, str]]:
    """ Yield file content based on patterns from the source directory, excluding certain patterns and directories.

    Args:
        src_path (Path): The base directory to search for files.
        patterns (list[str]): List of file patterns to include (e.g., ['*.py', '*.txt']).

    Yields:
        Iterator[tuple[Path, str]]: A tuple of file path and its content as a string.
    """
```

**Назначение**: Генерирует содержимое файлов, соответствующих заданным шаблонам, из исходной директории, исключая определенные шаблоны и директории.

**Параметры**:

*   `src_path` (Path): Базовая директория для поиска файлов.
*   `patterns` (list[str]): Список шаблонов файлов для включения (например, `['*.py', '*.txt']`).

**Возвращает**:

*   `Iterator[tuple[Path, str]]`: Итератор, возвращающий кортеж, содержащий путь к файлу и его содержимое в виде строки.

**Как работает функция**:

1.  **Определение исключаемых шаблонов и директорий**: Функция определяет регулярные выражения для исключаемых файлов и директорий.
    *   Исключаются файлы и директории, содержащие круглые скобки.
    *   Исключаются файлы или директории, начинающиеся с трех и более подчеркиваний.
    *   Исключаются служебные директории: `'.ipynb_checkpoints'`, `'_experiments'`, `'__pycache__'`, `'.git'`, `'.venv'`.

2.  **Итерация по шаблонам**: Функция итерируется по списку шаблонов файлов.

3.  **Поиск файлов**: Для каждого шаблона функция выполняет рекурсивный поиск файлов в исходной директории (`src_path`) с использованием `rglob`.

4.  **Исключение файлов и директорий**: Для каждого найденного файла функция проверяет, не находится ли он в исключаемой директории и не соответствует ли исключаемому шаблону. Если файл находится в исключаемой директории или соответствует исключаемому шаблону, он пропускается.

5.  **Чтение содержимого файла**: Если файл не исключен, функция считывает его содержимое с использованием кодировки UTF-8.

6.  **Генерация результата**: Функция возвращает путь к файлу и его содержимое в виде кортежа.

**ASCII flowchart**:

```
Начало
  ↓
Определение исключаемых шаблонов и директорий
  ↓
Итерация по шаблонам
  ↓
Поиск файлов
  ↓
Исключение файлов и директорий
  ↓
Чтение содержимого файла
  ↓
Генерация результата
  ↓
Конец
```

**Примеры**:

```python
from pathlib import Path
src_path = Path('.')
patterns = ['*.py', '*.txt']
for file_path, content in yield_files_content(src_path, patterns):
    print(f"File: {file_path}")
    print(f"Content: {content[:100]}...")